+-----------------------------------------------------------------------+
|                                                                       |
|                                                                       |
|                             MENTOR(tm)                                |
|                                                                       |
|                       PowerPro(tm) Software                           |
|                                                                       |
|                                                                       |
| This program contains confidential, trade secret information of       |
| Mentor Graphics Corporation.  Any reproduction, use or disclosure     |
| of this program, including any attempt to obtain a human-readable     |
| version of this program, without the express, prior written consent   |
| of Mentor Graphics Corporation is strictly prohibited.                |
|                                                                       |
|       Copyright (c) 2002 - 2019, Mentor Graphics Corporation          |
|                         All rights reserved.                          |
|                                                                       |
| Mentor acknowledges trademarks or registered trademarks of other      |
| organizations for their respective products and services.             |
|                                                                       |
| PowerPro-10.3c_2/849904   (Jan 10 2020)  linux64  P2001101230         |
|                                                                       |
|                                                                       |
| 64-bit mode                                                           |
| CentOS Linux release 8.4.2105 x86_64                                  |
| Intel(R) Xeon(R) CPU E5-2690 v3 @ 2.60GHz x 48                        |
| 396150728 kB                                                          |
| amazone.esat.kuleuven.be                     Tue Jul 13 11:46:19 2021 |
|                                                                       |
+-----------------------------------------------------------------------+
Command-line: /esat/micas-data/software/Mentor/catapult_10.5c/pkgs/cds_ppro/rls/bin/powerpro -connect 1439 -64 -cg -workdir /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_pre_pwropt_v

     [APP-SCP]    Setting the currently running product to PowerPro CG.

  
	License daemon :	mgcld
	License file :		
	Following are the checked out license features :
		PProBase PProAnalysis PProCGopt PProWriteRTL

    
	Following are the environment variables used : 
		CALYPTOD_LICENSE_FILE	=	
		LM_LICENSE_FILE		=	
		MGLS_CONN_TIMEOUT	=	
		MGLS_DEBUG_LOG_DIR	=	
		MGLS_EXCLUDE_LICENSES	=	
		MGLS_EXP_WARN_DAYS	=	
		MGLS_HOME		=	
		MGLS_INCLUDE_LICENSES	=	
		MGLS_LICENSE_FILE	=	1717@licserv
		MGLS_LICENSE_SEARCH	=	
		MGLS_LICENSE_SOURCE	=	
		MGLS_PKGINFO_FILE	=	

Tue Jul 13 11:46:19 CEST 2021
Linux amazone.esat.kuleuven.be 4.18.0-305.3.1.el8.x86_64 #1 SMP Tue Jun 1 16:14:33 UTC 2021 x86_64 x86_64 x86_64 GNU/Linux
LSB Version:	:core-4.1-amd64:core-4.1-noarch
Distributor ID:	CentOS
Description:	CentOS Linux release 8.4.2105
Release:	8.4.2105
Codename:	n/a

top - 11:46:19 up 27 days,  3:03,  5 users,  load average: 5.13, 5.66, 6.40
Tasks: 801 total,   5 running, 796 sleeping,   0 stopped,   0 zombie
%Cpu(s):  8.5 us,  0.3 sy,  0.0 ni, 91.0 id,  0.0 wa,  0.1 hi,  0.1 si,  0.0 st
MiB Mem : 386865.9 total, 362477.7 free,   7558.8 used,  16829.5 buff/cache
MiB Swap:  65536.0 total,  65536.0 free,      0.0 used. 375966.5 avail Mem 

    PID USER      PR  NI    VIRT    RES    SHR S  %CPU  %MEM     TIME+ COMMAND
  53275 r0678912  20   0 6218936 211384 125940 R  88.9   0.1  38344:41 kwin_x11
  68484 r0678912  20   0 6210432 214480 127320 R  88.9   0.1  38120:39 kwin_x11
 125234 r0678912  20   0 6236916 242684 150360 R  88.9   0.1  37217:41 kwin_x11
3057416 r0678912  20   0 6245340 229636 132660 R  88.9   0.1 863:47.50 kwin_x11
   2411 root      20   0  807004   6148   3396 S   5.6   0.0  30:24.46 collectd
3177260 r0678912  20   0  275856   5820   4460 R   5.6   0.0   0:00.03 top
      1 root      20   0  252484  14976   9780 S   0.0   0.0   9:17.90 systemd
      2 root      20   0       0      0      0 S   0.0   0.0   0:08.62 kthreadd
      3 root       0 -20       0      0      0 I   0.0   0.0   0:00.00 rcu_gp
      4 root       0 -20       0      0      0 I   0.0   0.0   0:00.00 rcu_par+
      6 root       0 -20       0      0      0 I   0.0   0.0   0:00.00 kworker+
      8 root      20   0       0      0      0 I   0.0   0.0   4:28.60 kworker+
     10 root       0 -20       0      0      0 I   0.0   0.0   0:00.00 mm_perc+
     11 root      20   0       0      0      0 S   0.0   0.0   0:36.40 ksoftir+
     12 root      20   0       0      0      0 I   0.0   0.0  22:58.47 rcu_sch+
     13 root      rt   0       0      0      0 S   0.0   0.0   0:00.72 migrati+
     14 root      rt   0       0      0      0 S   0.0   0.0   0:00.23 watchdo+

Filesystem                                             Size  Used Avail Use% Mounted on
kwak.esat.kuleuven.be:/san/students/students/r0678912  2.0T  1.5T  536G  74% /users/students/r0678912

Soft limits
core file size          (blocks, -c) unlimited
data seg size           (kbytes, -d) unlimited
scheduling priority             (-e) 0
file size               (blocks, -f) unlimited
pending signals                 (-i) 1547275
max locked memory       (kbytes, -l) 64
max memory size         (kbytes, -m) unlimited
open files                      (-n) 16384
pipe size            (512 bytes, -p) 8
POSIX message queues     (bytes, -q) 819200
real-time priority              (-r) 0
stack size              (kbytes, -s) unlimited
cpu time               (seconds, -t) unlimited
max user processes              (-u) 5166
virtual memory          (kbytes, -v) unlimited
file locks                      (-x) unlimited

Hard limits
core file size          (blocks, -c) unlimited
data seg size           (kbytes, -d) unlimited
scheduling priority             (-e) 0
file size               (blocks, -f) unlimited
pending signals                 (-i) 1547275
max locked memory       (kbytes, -l) 64
max memory size         (kbytes, -m) unlimited
open files                      (-n) 32768
pipe size            (512 bytes, -p) 8
POSIX message queues     (bytes, -q) 819200
real-time priority              (-r) 0
stack size              (kbytes, -s) unlimited
cpu time               (seconds, -t) unlimited
max user processes              (-u) 5166
virtual memory          (kbytes, -v) unlimited
file locks                      (-x) unlimited

 *)
 ;;
 ;;
 ;;
 ;;
}
}
}
}
}
BASH_FUNC_ml%%=() {  module ml "$@"
BASH_FUNC_module%%=() {  _module_raw "$@" 2>&1
BASH_FUNC__module_raw%%=() {  unset _mlshdbg;
BASH_FUNC_scl%%=() {  if [ "$1" = "load" -o "$1" = "unload" ]; then
BASH_FUNC_switchml%%=() {  typeset swfound=1;
CALYPTO_ARGV0=/esat/micas-data/software/Mentor/catapult_10.5c/pkgs/cds_ppro/rls/bin/powerpro
CALYPTO_INSTALL_PATH=/esat/micas-data/software/Mentor/catapult_10.5c/pkgs/cds_ppro/rls
CALYPTO_LD_LIBRARY_PATH=/esat/micas-data/software/Mentor/catapult_10.5c/pkgs/cds_ppro/rls/platform/linux64/lib:/esat/micas-data/software/Mentor/catapult_10.5c/lib:/esat/micas-data/software/Mentor/catapult_10.5c/shared/lib:
CALYPTO_LICENSE_LOG=252764@amazone.esat.kuleuven.be:3177206,1626169579
 case "$-" in 
CATAPULT_HOME=/esat/micas-data/software/Mentor/catapult_10.5c
CDS_GENUS=/esat/micas-data/software/Cadence/genus_19.11
CDS_INNOVUS=/esat/micas-data/software/Cadence/innovus_17.11
COLORFGBG=0;15
COLORTERM=truecolor
DBUS_SESSION_BUS_ADDRESS=unix:abstract=/tmp/dbus-NA5XFOofCu,guid=a8ae738f80f25561de5f7df560ed524e
DISPLAY=:2
 do
 done;
 echo "Cannot switch to Modules $swname version, command not found";
 echo "Switching to Modules $swname version";
EDITOR=vi
 else
 else
 else
 else
 else
ENSCRIPT_LIBRARY=/usr/share/enscript
 esac;
ESAT_ARCH=linux-x86_64
 eval `eval ${_mlre} /usr/bin/tclsh /usr/share/Modules/libexec/modulecmd.tcl bash '"$@"'`;
 eval "module $@";
 eval `/usr/bin/tclsh /usr/share/Modules/libexec/modulecmd.tcl bash "$@"`;
 export MODULES_USE_COMPAT_VERSION;
 fi
 fi
 fi;
 fi;
 fi;
 fi;
 fi;
 fi;
 fi;
 fi;
 fi;
 fi;
 for _mlv in ${MODULES_RUN_QUARANTINE:-};
FREEPDK45=/esat/micas-data/data/design/freepdk45
GDK_CORE_DEVICE_EVENTS=1
GLIBCPP_FORCE_NEW=1
GLIBCXX_FORCE_NEW=1
GS_OPTIONS=-sPAPERSIZE=a4
GTK2_RC_FILES=/users/students/r0678912/.gtkrc-2.0-kde4
HISTCONTROL=ignoredups
HISTSIZE=1000
HOME=/users/students/r0678912
HOSTNAME=amazone.esat.kuleuven.be
 if [ "${_mlv}" = "${_mlv##*[!A-Za-z0-9_]}" -a "${_mlv}" = "${_mlv#[0-9]}" ]; then
 if [ "${MODULES_SILENT_SHELL_DEBUG:-0}" = '1' ]; then
 if [ "${MODULES_USE_COMPAT_VERSION:-0}" = '1' ]; then
 if [ $swfound -eq 0 ]; then
 if [ -e /usr/share/Modules/libexec/modulecmd-compat ]; then
 if [ -e /usr/share/Modules/libexec/modulecmd.tcl ]; then
 if [ -n "${IFS+x}" ]; then
 if [ -n "${_mlIFS+x}" ]; then
 if [ -n "${_mlre:-}" ]; then
 if [ -n "${_mlshdbg:-}" ]; then
 if [ -n "`eval 'echo ${'$_mlv'+x}'`" ]; then
 IFS=' ';
 IFS=$_mlIFS;
KDEDIRS=/usr
KDED_STARTED_BY_KDEINIT=1
KDE_FULL_SESSION=true
KDE_SESSION_UID=252764
KDE_SESSION_VERSION=5
KONSOLE_DBUS_SERVICE=:1.34
KONSOLE_DBUS_SESSION=/Sessions/1
KONSOLE_DBUS_WINDOW=/Windows/1
KONSOLE_VERSION=191202
KRB5CCNAME=KCM:
LANG=en_US.UTF-8
LANGUAGE=
LD_LIBRARY_PATH=/esat/micas-data/software/Mentor/catapult_10.5c/pkgs/cds_ppro/rls/platform/linux64/lib:/esat/micas-data/software/Mentor/catapult_10.5c/lib:/esat/micas-data/software/Mentor/catapult_10.5c/shared/lib:
LD_LIBRARY_PATH_ORIG=/esat/micas-data/software/Mentor/catapult_10.5c/lib:/esat/micas-data/software/Mentor/catapult_10.5c/shared/lib:
LESSOPEN=||/usr/bin/lesspipe.sh %s
LOADEDMODULES=
LOGNAME=r0678912
LPDEST=ulstudent
LS_COLORS=rs=0:di=38;5;33:ln=38;5;51:mh=00:pi=40;38;5;11:so=38;5;13:do=38;5;5:bd=48;5;232;38;5;11:cd=48;5;232;38;5;3:or=48;5;232;38;5;9:mi=01;05;37;41:su=48;5;196;38;5;15:sg=48;5;11;38;5;16:ca=48;5;196;38;5;226:tw=48;5;10;38;5;16:ow=48;5;10;38;5;21:st=48;5;21;38;5;15:ex=38;5;40:*.tar=38;5;9:*.tgz=38;5;9:*.arc=38;5;9:*.arj=38;5;9:*.taz=38;5;9:*.lha=38;5;9:*.lz4=38;5;9:*.lzh=38;5;9:*.lzma=38;5;9:*.tlz=38;5;9:*.txz=38;5;9:*.tzo=38;5;9:*.t7z=38;5;9:*.zip=38;5;9:*.z=38;5;9:*.dz=38;5;9:*.gz=38;5;9:*.lrz=38;5;9:*.lz=38;5;9:*.lzo=38;5;9:*.xz=38;5;9:*.zst=38;5;9:*.tzst=38;5;9:*.bz2=38;5;9:*.bz=38;5;9:*.tbz=38;5;9:*.tbz2=38;5;9:*.tz=38;5;9:*.deb=38;5;9:*.rpm=38;5;9:*.jar=38;5;9:*.war=38;5;9:*.ear=38;5;9:*.sar=38;5;9:*.rar=38;5;9:*.alz=38;5;9:*.ace=38;5;9:*.zoo=38;5;9:*.cpio=38;5;9:*.7z=38;5;9:*.rz=38;5;9:*.cab=38;5;9:*.wim=38;5;9:*.swm=38;5;9:*.dwm=38;5;9:*.esd=38;5;9:*.jpg=38;5;13:*.jpeg=38;5;13:*.mjpg=38;5;13:*.mjpeg=38;5;13:*.gif=38;5;13:*.bmp=38;5;13:*.pbm=38;5;13:*.pgm=38;5;13:*.ppm=38;5;13:*.tga=38;5;13:*.xbm=38;5;13:*.xpm=38;5;13:*.tif=38;5;13:*.tiff=38;5;13:*.png=38;5;13:*.svg=38;5;13:*.svgz=38;5;13:*.mng=38;5;13:*.pcx=38;5;13:*.mov=38;5;13:*.mpg=38;5;13:*.mpeg=38;5;13:*.m2v=38;5;13:*.mkv=38;5;13:*.webm=38;5;13:*.ogm=38;5;13:*.mp4=38;5;13:*.m4v=38;5;13:*.mp4v=38;5;13:*.vob=38;5;13:*.qt=38;5;13:*.nuv=38;5;13:*.wmv=38;5;13:*.asf=38;5;13:*.rm=38;5;13:*.rmvb=38;5;13:*.flc=38;5;13:*.avi=38;5;13:*.fli=38;5;13:*.flv=38;5;13:*.gl=38;5;13:*.dl=38;5;13:*.xcf=38;5;13:*.xwd=38;5;13:*.yuv=38;5;13:*.cgm=38;5;13:*.emf=38;5;13:*.ogv=38;5;13:*.ogx=38;5;13:*.aac=38;5;45:*.au=38;5;45:*.flac=38;5;45:*.m4a=38;5;45:*.mid=38;5;45:*.midi=38;5;45:*.mka=38;5;45:*.mp3=38;5;45:*.mpc=38;5;45:*.ogg=38;5;45:*.ra=38;5;45:*.wav=38;5;45:*.oga=38;5;45:*.opus=38;5;45:*.spx=38;5;45:*.xspf=38;5;45:
MAILCHECK=0
MAIL=/var/spool/mail/r0678912
MANPATH=::/opt/puppetlabs/puppet/share/man:/freeware/man:/software/man:/esat/micas-data/software/Cadence/innovus_17.11/share/fe/man:/esat/micas-data/software/Cadence/innovus_17.11/share/fe/man
MGC_ENV_ORIG_MGC_HOME=/esat/micas-data/software/Mentor/catapult_10.5c
MGC_ENV_ORIG_PATH=/usr/share/Modules/bin:/usr/local/bin:/usr/bin:/usr/local/sbin:/usr/sbin:/opt/puppetlabs/bin:/freeware/bin/gnu-tools:/freeware/bin:/software/bin:/esat/micas-data/software/Mentor/catapult_10.5c/bin:/esat/micas-data/software/Mentor/questasim_2020.4/questasim/bin:/esat/micas-data/software/Cadence/innovus_17.11/bin:/esat/micas-data/software/Cadence/genus_19.11/bin:/esat/micas-data/software/Mentor/catapult_10.5c/bin:/esat/micas-data/software/Mentor/questasim_2020.4/questasim/bin:/esat/micas-data/software/Cadence/innovus_17.11/bin:/esat/micas-data/software/Cadence/genus_19.11/bin
MGC_EXENAME=catapult
MGC_HOME=/esat/micas-data/software/Mentor/catapult_10.5c
MGC_QUESTA_HOME=/esat/micas-data/software/Mentor/questasim_2020.4
MGLS_LICENSE_FILE=1717@licserv
MICAS_LICENSE_FILE=/users/micas/micas/license/license.dat
 _mlIFS=$IFS;
 _mlre="${_mlre:-}${_mlv}='`eval 'echo ${'$_mlrv':-}'`' ";
 _mlre="${_mlre:-}${_mlv}_modquar='`eval 'echo ${'$_mlv'}'`' ";
 _mlrv="MODULES_RUNENV_${_mlv}";
 _mlshdbg=''
 _mlshdbg='v'
 _mlshdbg='vx'
 _mlshdbg='x'
 _mlstatus=$?;
MODULEPATH=/etc/scl/modulefiles:/usr/share/Modules/modulefiles:/etc/modulefiles:/usr/share/modulefiles
MODULEPATH_modshare=/usr/share/modulefiles:1:/usr/share/Modules/modulefiles:1:/etc/modulefiles:1
MODULES_CMD=/usr/share/Modules/libexec/modulecmd.tcl
MODULESHOME=/usr/share/Modules
MODULES_RUN_QUARANTINE=LD_LIBRARY_PATH LD_PRELOAD
 MODULES_USE_COMPAT_VERSION=1;
OLDPWD=/users/students/r0678912/Downloads/zigzag/hls_impl/COREmem/memories
OPENRAM_HOME=/users/students/r0678912/openram/compiler
OPENRAM_TECH=/users/students/r0678912/openram/technology
PATH=/esat/micas-data/software/Mentor/catapult_10.5c/bin:/esat/micas-data/software/Mentor/catapult_10.5c/lib:/esat/micas-data/software/Mentor/catapult_10.5c/pkgs/sif/.lib:/usr/share/Modules/bin:/usr/local/bin:/usr/bin:/usr/local/sbin:/usr/sbin:/opt/puppetlabs/bin:/freeware/bin/gnu-tools:/freeware/bin:/software/bin:/esat/micas-data/software/Mentor/catapult_10.5c/bin:/esat/micas-data/software/Mentor/questasim_2020.4/questasim/bin:/esat/micas-data/software/Cadence/innovus_17.11/bin:/esat/micas-data/software/Cadence/genus_19.11/bin:/esat/micas-data/software/Mentor/catapult_10.5c/bin:/esat/micas-data/software/Mentor/questasim_2020.4/questasim/bin:/esat/micas-data/software/Cadence/innovus_17.11/bin:/esat/micas-data/software/Cadence/genus_19.11/bin
PPRO_ENVCONFIG_STATUS=0
PRINTER=ulstudent
PROFILEHOME=
PWD=/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF
PYTHONPATH=:/users/students/r0678912/openram/compiler:/users/students/r0678912/openram/compiler
QT_AUTO_SCREEN_SCALE_FACTOR=0
 return $_mlstatus
 return 1;
S_COLORS=auto
SELINUX_LEVEL_REQUESTED=
SELINUX_ROLE_REQUESTED=
SELINUX_USE_CURRENT_RANGE=
 set -$_mlshdbg;
 set +v;
 set +vx;
 set +x;
SHELL=/bin/bash
SHELL_SESSION_ID=9c500abd127d4dbc8a0c15fe695aa649
SHLVL=6
 source /usr/share/Modules/init/bash;
SSH_AGENT_PID=3160730
SSH_ASKPASS=/usr/bin/ksshaskpass
SSH_AUTH_SOCK=/tmp/ssh-0tMchTkQmbTf/agent.3160671
SSH_CLIENT=134.58.56.167 52702 22
SSH_CONNECTION=134.58.56.167 52702 10.87.20.53 22
SSH_TTY=/dev/pts/0
TCL_PRINTER_CONFFILE=/dev/null
TERM=xterm-256color
TK_LIBRARY=/esat/micas-data/software/Mentor/catapult_10.5c/lib/tk8.5
TMPDIR=/tmp
 typeset swfound=0;
 typeset swfound=0;
 typeset swname='compatibility';
 typeset swname='main';
 unset IFS;
 unset _mlre _mlIFS;
 unset _mlre _mlv _mlrv _mlIFS;
 unset _mlshdbg;
 unset MODULES_USE_COMPAT_VERSION;
USER=r0678912
_=/usr/bin/printenv
 /usr/bin/scl "$@";
 *v*)
VCO=aol
VISUAL=vi
VNCDESKTOP=amazone.esat.kuleuven.be:2 (r0678912)
 *v*x*)
WINDOWID=8388615
 *x*)
XCURSOR_THEME=breeze_cursors
XDG_CONFIG_DIRS=/etc/xdg:/usr/share/kde-settings/kde-profile/default/xdg
XDG_CURRENT_DESKTOP=KDE
XDG_DATA_DIRS=/users/students/r0678912/.local/share/flatpak/exports/share:/var/lib/flatpak/exports/share:/usr/local/share:/usr/share
XDG_MENU_PREFIX=kf5-
XDG_RUNTIME_DIR=/run/user/252764
XDG_SESSION_ID=9044

<WRN>[PPRO-FRNL]  Cannot use the 'read_fsdb' command in the current session because the shell environment variable 'NOVAS_LD_LIBRARY_PATH' has not been set. To use the command, set the environment variable to specify the directory location that contains the latest version of the dynamic library files libnffr.so and libnsys.so and try again.
                  Please try 'help PPRO-FRNL' for more detailed help.
     [UI-MIDA]    Message "CDBT-CGI" is now disabled after 3 repeated appearances.
     [UI-MIDA]    Message "CDBT-CBFL" is now disabled after 3 repeated appearances.
     [UI-MIDA]    Message "CDBT-CGW" is now disabled after 3 repeated appearances.
     [UI-MIDA]    Message "PPRO-SSOC" is now disabled after 3 repeated appearances.
     [UI-MIDA]    Message "OPT-OEUCT" is now disabled after 3 repeated appearances.
     [UI-MIDA]    Message "ENOP-PSTEL" is now disabled after 1000 repeated appearances.
     [UI-MIDA]    Message "PPRO-SLNVO" is now disabled after 3 repeated appearances.
     [UI-MIDA]    Message "STA-SSONS" is now disabled after 3 repeated appearances.
     [UI-MIDA]    Message "PA-PWCNF" is now disabled after 3 repeated appearances.
     [UI-MIDA]    Message "STA-SGNSC" is now disabled after 3 repeated appearances.
     [UI-MIDA]    Message "CDBL-MPP" is now disabled after 3 repeated appearances.
     [PPRO-EVND]  Environment variable 'PPRO_QUESTA_HOME' not defined.
     [PPRO-EVND]  Environment variable 'PPRO_VISUALIZER_HOME' not defined.
<WRN>[PPRO-VVVM]  Cannot find the required version of Visualizer.
                  Please try 'help PPRO-VVVM' for more detailed help.
<WRN>[PPRO-VQVM]  Cannot find the required version of Questa Sim.
                  Please try 'help PPRO-VQVM' for more detailed help.
powerpro> get_global build_ident
PowerPro-10.3c_2/849904   (Jan 10 2020)  linux64  P2001101230

powerpro> cd /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF
powerpro> set_powerpro_mode power_analysis
     [PPRO-IPAM]  Ignoring powerpro_mode 'power_analysis' because global 'pa_cg_integrated_flow' is set to 1.
powerpro> set_global message_wrap_at 10000
10000

powerpro> set_global fsdb_lib_version 17
17

powerpro> config_write_rtl -use_iterative_write_rtl yes
powerpro> config_write_rtl -enlogic_file_naming_scheme top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000_enLogic
powerpro> config_write_rtl -vhdl_new_logic_package_name top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000_calypto_package
powerpro> config_write_rtl -vhdl_tc_package_name top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000_powerpro_tc_package
powerpro> config_write_rtl -generate_X_aware_enable no
powerpro> set_global __idcsa_filt_ff_intercept 0.01
0.01

powerpro> set_global __idcsa_filt_support_intercept 0.01
0.01

powerpro> set_global __idcsa_filt_combnode_intercept 0.01
0.01

powerpro> read_library /esat/micas-data/software/Mentor/catapult_10.5c/pkgs/siflibs/nangate/nangate45nm_nldm.lib
<WRN>[CDBL-NCFG]  No callback has been registered for "statetablecell" group context combination.
                  Please try 'help CDBL-NCFG' for more detailed help.

                  (Subsequent repetitions of this message will be suppressed.
                   Use 'enable_msg CDBL-NCFG' to show all repetitions.)

     [PPRO-SOC]   Setting the operating condition 'typical' from the library 'NangateOpenCellLibrary' as the active 'operating_condition' for the design. Specifying the values for process as '1', temperature as '25' and voltage as '1.1'. Use the 'set_operating_condition' command to explicitly specify the default operating condition.
     [CDBL-LRS]   Library "/esat/micas-data/software/Mentor/catapult_10.5c/pkgs/siflibs/nangate/nangate45nm_nldm.lib" read successfully.
     [UI-STATS]   PowerPro process is using 59 MB, peak 95 MB, and 1 seconds [+59MB, +95MB, +1s] @ Tue Jul 13 11:46:20 2021
powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000001.v
     [UI-BDLM]    Please refer to /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_pre_pwropt_v/build_design.log for a comprehensive list of messages and warnings issued in build_design. These may provide hints for debugging issues (if any) related to performance, potential out of bound accesses etc.

                  (Subsequent repetitions of this message will be suppressed.
                   Use 'enable_msg UI-BDLM' to show all repetitions.)

     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 100 MB, and 1 seconds [+38MB, +5MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000003.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 100 MB, and 1 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000005.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 100 MB, and 1 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000007.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 100 MB, and 1 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000009.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 100 MB, and 1 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000005_1.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 101 MB, and 1 seconds [+0MB, +1MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000005_2.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 102 MB, and 1 seconds [+0MB, +1MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000005_3.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 102 MB, and 1 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000005_4.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 102 MB, and 1 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000005_5.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 98 MB, peak 102 MB, and 1 seconds [+1MB, +0MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000000.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 100 MB, peak 104 MB, and 1 seconds [+2MB, +2MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> link_design -top top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000
     [CPT-LDF]    Linking the 'work' design library.
     [CPT-RDFD]   RTL design files dump enabled.
     [UI-STATS]   PowerPro process is using 123 MB, peak 156 MB, and 1 seconds [+23MB, +52MB, +0s] @ Tue Jul 13 11:46:21 2021

     [UI-STATS]   PowerPro process is using 123 MB, peak 156 MB, and 1 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:21 2021

1

powerpro> build_db
     [CPT-STN]    Synthesizing the 'work' design library.
     [CDB-STH]    Setting 'top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000' as the top module of the 'work' design library.
     [CPT-FBD]    Finished synthesizing the 'work' design library.
     [PPRO-GPI]   OptTechnician report_build start : PowerPro process is using 87 MB, peak 156 MB, and 2 seconds [-36MB, +0MB, +1s] @ Tue Jul 13 11:46:21 2021
     [UI-STATS]   PowerPro process is using 87 MB, peak 156 MB, and 2 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:21 2021

powerpro> set_operating_condition typical -library NangateOpenCellLibrary
<WRN>[PPRO-GPM]   Previous op-cond constraint being cleared on top-hierarchy
     [PPRO-SOC]   Setting the operating condition 'typical' from the library 'NangateOpenCellLibrary' as the active 'operating_condition' for the design. Specifying the values for process as '1', temperature as '25' and voltage as '1.1'. Use the 'set_operating_condition' command to explicitly specify the default operating condition.
powerpro> set_wire_load_mode top
     [PPRO-WLCS]  Storing constraint for command 'set_wire_load_mode', to be applied later in the flow.
                  Please try 'help PPRO-WLCS' for more detailed help.
powerpro> create_clock -name CLOCKclk -period 10.0 clk
     [STA-SCCOP]  Created a clock with name 'CLOCKclk' on port 'clk'.
powerpro> read_saif -name_divider / -instance_name scverify_top/rtl /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/switching_v/default.saif
     [UI-STATC]   Started execution of "read_saif" command. Stats "PowerPro process is using 87 MB, peak 156 MB, and 2 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:21 2021".
     [PA-RSSI]    Started execution of read_saif's intermediate stage "Data base normalization". Stats "PowerPro process is using 87 MB, peak 156 MB, and 2 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:21 2021".
     [CDB-LBSI]   Started execution of _break_comb_loop's intermediate stage "Break Comb Loop". Stats "PowerPro process is using 87 MB, peak 156 MB, and 2 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:21 2021".
     [CDB-CCLBE]  Number of anchor points found in design is '0'.
     [CDB-CCLBB]  Number of comb loop blackboxes is '0'.
     [CDB-LBSI]   Finished execution of _break_comb_loop's intermediate stage "Break Comb Loop". Stats "PowerPro process is using 87 MB, peak 156 MB, and 2 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:21 2021".
     [PPRO-SSSI]  { Stage DB_NORMALIZE START_RUNTIME } { Stats 'PowerPro process is using 87 MB, peak 156 MB, and 2 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:21 2021' }
     [PPRO-SSSI]  { Stage DB_NORMALIZE END_RUNTIME } { Stats 'PowerPro process is using 86 MB, peak 156 MB, and 2 seconds [-1MB, +0MB, +0s] @ Tue Jul 13 11:46:22 2021' }
     [PA-RSSI]    Finished execution of read_saif's intermediate stage "Data base normalization". Stats "PowerPro process is using 86 MB, peak 156 MB, and 2 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:22 2021".
     [PA-RSSI]    Started execution of read_saif's intermediate stage "Deleting Existing SA Data". Stats "PowerPro process is using 86 MB, peak 156 MB, and 2 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:22 2021".
     [PA-RSSI]    Finished execution of read_saif's intermediate stage "Deleting Existing SA Data". Stats "PowerPro process is using 87 MB, peak 156 MB, and 2 seconds [+1MB, +0MB, +0s] @ Tue Jul 13 11:46:22 2021".
     [PA-RSSI]    Started execution of read_saif's intermediate stage "ParseSaifFile SAIF file". Stats "PowerPro process is using 87 MB, peak 156 MB, and 2 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:22 2021".
     [PA-PRSF]    Reading SAIF File : "/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/switching_v/default.saif".
     [PA-PSSIN]   Start instance in Saif file : scverify_top.rtl. Start design instance : Top Level Module
     [PA-RSSI]    Finished execution of read_saif's intermediate stage "ParseSaifFile SAIF file". Stats "PowerPro process is using 90 MB, peak 156 MB, and 3 seconds [+3MB, +0MB, +1s] @ Tue Jul 13 11:46:22 2021".
     [PA-RSSI]    Started execution of read_saif's intermediate stage "Summary Generation". Stats "PowerPro process is using 90 MB, peak 156 MB, and 3 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:22 2021".
     [CDBT-STL]   Setting target technology library to "NangateOpenCellLibrary".
     [PA-RSS]     
                  ------------------------------------------------------------
                  Total Primary Inputs/Inouts            : 542 (100%)
                  Asserted Primary Inputs/Inouts         : 542 (100%)
                  ------------------------------------------------------------
                  Total Flop Outputs                     : 3447 (100%)
                  Asserted Flop Outputs                  : 3447 (100%)
                  Asserted Flop Clock Ports              : 3447 (100%)
                  Total CGIC Output Ports                : 0 (0%)
                  Asserted CGIC Output Ports             : 0 (0%)
                  ------------------------------------------------------------
                  Total Memories                         : 0 (0%)
                  Memories With All Inputs Asserted      : 0 (0%)
                  Memories With All Outputs Asserted     : 0 (0%)
                  Memories With All Clock Ports Asserted : 0 (0%)
                  ------------------------------------------------------------
                  Total Data Path Operators                    : 7 (100%)
                  Total Data Path Operators with Any Input User Net : 7 (100%)
                  Data Path Operators With All Inputs Asserted : 7 (100%)
                  Total Data Path Operators with Any Output User Net: 7 (100%)
                  Data Path Operators With All Outputs Asserted: 7 (100%)
                  ------------------------------------------------------------
                  Total IO Pad Cells                    : 0 (0%)
                  IO Pad Cells With All Inputs Asserted : 0 (0%)
                  IO Pad Cells With All Outputs Asserted: 0 (0%)
                  ------------------------------------------------------------
                  Total Nets                             : 17459 (100%)
                  User Nets                              : 7424 (42.52%)
                  Asserted User Nets                     : 7424 (100%)
                  ------------------------------------------------------------

                  Please try 'help PA-RSS' for more detailed help.
     [PA-RSSI]    Finished execution of read_saif's intermediate stage "Summary Generation". Stats "PowerPro process is using 100 MB, peak 172 MB, and 3 seconds [+10MB, +16MB, +0s] @ Tue Jul 13 11:46:22 2021".
     [UI-STATC]   Finished execution of "read_saif" command. Stats "PowerPro process is using 100 MB, peak 172 MB, and 3 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:22 2021".
powerpro> config_clock_tree -buffer BUF_X2 -fanout 16 -root_buffer BUF_X2 -root_buffer_fanout 8 -final_buffer BUF_X2 -final_buffer_fanout 32
     [PPRO-CCTFV] Clock tree fanout is set to 16.
     [PPRO-CCTFV] Clock tree final_buffer_fanout is set to 32.
     [PPRO-CCTFV] Clock tree root_buffer_fanout is set to 8.
     [PPRO-CCTFV] Clock tree buffer is set to BUF_X2.
     [PPRO-CCTFV] Clock tree final_buffer is set to BUF_X2.
     [PPRO-CCTFV] Clock tree root_buffer is set to BUF_X2.
     [PPRO-CTC]   Clock tree configuration is saved for power analysis.
powerpro> ::get_version
10.3c_2

powerpro> prototype_design
     [PPRO-SSSI]  { Stage PROTO BEGIN_RUNTIME } { Stats 'PowerPro process is using 100 MB, peak 172 MB, and 3 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:22 2021' }
     [PPRO-SSSI]  { Stage PROTO_OPTIMIZATION BEGIN_RUNTIME } { Stats 'PowerPro process is using 100 MB, peak 172 MB, and 3 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:22 2021' }
     [PPRO-STM]   Synthesizing the design with the top-level module as 'top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000'.
     [PPRO-SGO]   Prototyping 'top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000'.
     [PPRO-SXGM]  Performing node decomposition, loop identification and mux normalization.
     [UI-STATS]   PowerPro process is using 100 MB, peak 172 MB, and 3 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:22 2021
     [CDBT-CCTC]  "CPL_MUX_2" is bound to tech cell "GTL_MUX2_MUX2_X1".
     [CDBT-CGI]   For this leakage group when cond does not exist, when cond must exist for a leakage group. GTL_CGIC_LATCH_POSEDGE_CLKGATE_X1
     [CDBT-CCTC]  "CPL_CGIC_LATCH_POSEDGE_CTRL" is bound to tech cell "GTL_CGIC_LATCH_POSEDGE_CLKGATE_X1".
     [CDBT-CCTC]  "CPL_ANDOR" is bound to tech cell "GTL_ANDOR_OAI21_X1".
     [CDBT-CCTC]  "CPL_FULLADDER" is bound to tech cell "GTL_FULLADDER_FA_X1".
     [CDBT-CCTC]  "CPL_OR" is bound to tech cell "GTL_OR_OR2_X1".
     [CDBT-CCTC]  "CPL_XOR" is bound to tech cell "GTL_XOR_XOR2_X1".
     [CDBT-CCTC]  "CPL_NOT" is bound to tech cell "GTL_NOT_INV_X1".
     [CDBT-CCTC]  "CPL_BUF" is bound to tech cell "GTL_BUF_BUF_X1".
     [CDBT-CCTC]  "CPL_HALFADDER" is bound to tech cell "GTL_HALFADDER_HA_X1".
     [CDBT-CCTC]  "CPL_NAND" is bound to tech cell "GTL_NAND_NAND2_X1".
     [CDBT-CNWP]  Creating node 'GTL_FF_1000_DFF_X1' with port_map d(D) clk(CK) q(Q) QN(1) .
     [CDBT-CGI]   For this leakage group when cond does not exist, when cond must exist for a leakage group. GTL_FF_1000_DFF_X1
     [CDBT-NSFU]  Non scan flop 'DFF_X1' used for binding. This can happen if 'set_binding' command is used, or no scan flops are present in library or all scan flops are marked dont_use.
                  Please try 'help CDBT-NSFU' for more detailed help.
     [CDBT-CCTC]  "CPL_MACROFF" is bound to tech cell "GTL_FF_1000_DFF_X1".
     [CDBT-CCTC]  "CPL_MACROFF" is bound to tech cell "GTL_FF_1000_DFF_X1".
     [CDBT-CNWP]  Creating node 'GTL_FF_1001_DFFR_X1' with port_map d(D) clk(CK) arst(!RN) q(Q) QN(1) .
     [CDBT-CGI]   For this leakage group when cond does not exist, when cond must exist for a leakage group. GTL_FF_1001_DFFR_X1

                  (Subsequent repetitions of this message will be suppressed.
                   Use 'enable_msg CDBT-CGI' to show all repetitions.)

     [CDBT-CCTC]  "CPL_MACROFF" is bound to tech cell "GTL_FF_1001_DFFR_X1".
     [CDBT-CNWP]  Creating node 'GTL_FF_1010_DFFS_X1' with port_map d(D) clk(CK) arst(!SN) q(Q) QN(1) .
     [CDBT-CCTC]  "CPL_MACROFF" is bound to tech cell "GTL_FF_1010_DFFS_X1".
     [CDBT-CNWP]  Creating node 'GTL_FF_1011_DFFRS_X1' with port_map d(D) clk(CK) arst(!RN) arst2(!SN) q(Q) QN(1) .
     [CDBT-CCTC]  "CPL_MACROFF" is bound to tech cell "GTL_FF_1011_DFFRS_X1".
     [CDBT-CCTC]  "CPL_AND" is bound to tech cell "GTL_AND_AND2_X1".
     [CDBT-CCTC]  "CPL_INV" is bound to tech cell "GTL_INV_INV_X1".
     [CDBT-CCTC]  "CPL_BEQ" is bound to tech cell "GTL_XNOR_XNOR2_X1".
     [CDBT-CCTC]  "CPL_NOR" is bound to tech cell "GTL_NOR_NOR2_X1".
     [CDBT-CNWP]  Creating node 'GTL_NFF_1000_DFF_X1' with port_map d(D) clk(!CK) q(Q) QN(1) .
     [CDBT-CCTC]  "CPL_NMACROFF" is bound to tech cell "GTL_NFF_1000_DFF_X1".
     [CDBT-CCTC]  "CPL_NMACROFF" is bound to tech cell "GTL_NFF_1000_DFF_X1".
     [CDBT-CNWP]  Creating node 'GTL_NFF_1001_DFFR_X1' with port_map d(D) clk(!CK) arst(!RN) q(Q) QN(1) .
     [CDBT-CCTC]  "CPL_NMACROFF" is bound to tech cell "GTL_NFF_1001_DFFR_X1".
     [CDBT-CNWP]  Creating node 'GTL_NFF_1010_DFFS_X1' with port_map d(D) clk(!CK) arst(!SN) q(Q) QN(1) .
     [CDBT-CCTC]  "CPL_NMACROFF" is bound to tech cell "GTL_NFF_1010_DFFS_X1".
     [CDBT-CNWP]  Creating node 'GTL_NFF_1011_DFFRS_X1' with port_map d(D) clk(!CK) arst(!RN) arst2(!SN) q(Q) QN(1) .
     [CDBT-CCTC]  "CPL_NMACROFF" is bound to tech cell "GTL_NFF_1011_DFFRS_X1".
     [CDBT-CBFL]  CPL-GTL binding for lib context with id '1' having constraints 'operating_condition: typical NangateOpenCellLibrary '.
     [CDBT-CCTC]  "CPL_MUX_2" is bound to tech cell "GTL_MUX2_MUX2_X1".
     [CDBT-CCTC]  "CPL_CGIC_LATCH_POSEDGE_CTRL" is bound to tech cell "GTL_CGIC_LATCH_POSEDGE_CLKGATE_X1".
     [CDBT-CCTC]  "CPL_ANDOR" is bound to tech cell "GTL_ANDOR_OAI21_X1".
     [CDBT-CCTC]  "CPL_FULLADDER" is bound to tech cell "GTL_FULLADDER_FA_X1".
     [CDBT-CCTC]  "CPL_OR" is bound to tech cell "GTL_OR_OR2_X1".
     [CDBT-CCTC]  "CPL_XOR" is bound to tech cell "GTL_XOR_XOR2_X1".
     [CDBT-CCTC]  "CPL_NOT" is bound to tech cell "GTL_NOT_INV_X1".
     [CDBT-CCTC]  "CPL_BUF" is bound to tech cell "GTL_BUF_BUF_X1".
     [CDBT-CCTC]  "CPL_HALFADDER" is bound to tech cell "GTL_HALFADDER_HA_X1".
     [CDBT-CCTC]  "CPL_NAND" is bound to tech cell "GTL_NAND_NAND2_X1".
     [CDBT-NSFU]  Non scan flop 'DFF_X1' used for binding. This can happen if 'set_binding' command is used, or no scan flops are present in library or all scan flops are marked dont_use.
                  Please try 'help CDBT-NSFU' for more detailed help.
     [CDBT-CCTC]  "CPL_MACROFF" is bound to tech cell "GTL_FF_1000_DFF_X1".
     [CDBT-CCTC]  "CPL_MACROFF" is bound to tech cell "GTL_FF_1000_DFF_X1".
     [CDBT-CCTC]  "CPL_MACROFF" is bound to tech cell "GTL_FF_1001_DFFR_X1".
     [CDBT-CCTC]  "CPL_MACROFF" is bound to tech cell "GTL_FF_1010_DFFS_X1".
     [CDBT-CCTC]  "CPL_MACROFF" is bound to tech cell "GTL_FF_1011_DFFRS_X1".
     [CDBT-CCTC]  "CPL_AND" is bound to tech cell "GTL_AND_AND2_X1".
     [CDBT-CCTC]  "CPL_INV" is bound to tech cell "GTL_INV_INV_X1".
     [CDBT-CCTC]  "CPL_BEQ" is bound to tech cell "GTL_XNOR_XNOR2_X1".
     [CDBT-CCTC]  "CPL_NOR" is bound to tech cell "GTL_NOR_NOR2_X1".
     [CDBT-CCTC]  "CPL_NMACROFF" is bound to tech cell "GTL_NFF_1000_DFF_X1".
     [CDBT-CCTC]  "CPL_NMACROFF" is bound to tech cell "GTL_NFF_1000_DFF_X1".
     [CDBT-CCTC]  "CPL_NMACROFF" is bound to tech cell "GTL_NFF_1001_DFFR_X1".
     [CDBT-CCTC]  "CPL_NMACROFF" is bound to tech cell "GTL_NFF_1010_DFFS_X1".
     [CDBT-CCTC]  "CPL_NMACROFF" is bound to tech cell "GTL_NFF_1011_DFFRS_X1".
     [ELEC-MFFV]  Max fanout for virtual buffering : 8
     [CDBT-OCDA]  Default Operating Condition is "typical" and Active Operating Condition is "typical".
     [CDBT-OCSF]  Scaling Factor being computed is "1".
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Library Characterization           3              172/112      44269
 ------------------------------------------------------------------------------
     [PPRO-SSSI]  { Stage PROTO_FSDB_TO_SA BEGIN_RUNTIME } { Stats 'PowerPro process is using 112 MB, peak 172 MB, and 3 seconds [+12MB, +0MB, +0s] @ Tue Jul 13 11:46:23 2021' }
     [PPRO-SSSI]  { Stage PROTO_FSDB_TO_SA END_RUNTIME } { Stats 'PowerPro process is using 112 MB, peak 172 MB, and 3 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:23 2021' }
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Waveform to SA                     3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Annotate Default SA on Design Elements          3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Phy layer generation               3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Post Processing of Multi VTH Constraints          3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Resolving Power Intent             3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Handling DW Comp                   3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Preserve SA at critical ports          3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Preserve mem user SA               3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Design checks                      3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Bit Level Clocks Processing          3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Replace User CGIC Cells            3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Break Loop                         3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Loop detection                     3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Unmap combinational cells          3              172/112          0
 ------------------------------------------------------------------------------
     [PPRO-SXDC]  The following are the characteristics of the design 'top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000'.
 Word-level instance count                    :       5579
 DP components                                :        155
 FFs                                          :        251
     [PPRO-MID]   The following 1-D/2-D memories found in the design. 
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Design stats                       3              172/112          0
 ------------------------------------------------------------------------------
     [PPRO-SXGM]  Performing generic opts: const prop, deadcode removal etc.
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 ECC logic detection                3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Resolve Multiple Drivers           3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Consistency Check                  3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Logic optimization                 3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Process Resets                     3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Simplify posedge flops             3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Simplify negedge flops             3              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Optimize steering logic            3              172/111          0
 ------------------------------------------------------------------------------
     [CDBO-WET]   Top hierarchy yielded 94 matches and replacements on word level specific transformations.
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Word level extraction              3              172/111          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Word level optimization            3              172/111          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Merge mux selects                  3              172/111          0
 ------------------------------------------------------------------------------
     [PPRO-SSSI]  { Stage WEN First Phase BEGIN_RUNTIME } { Stats 'PowerPro process is using 111 MB, peak 172 MB, and 4 seconds [-1MB, +0MB, +1s] @ Tue Jul 13 11:46:23 2021' }
     [PPRO-SSSI]  { Stage WEN First Phase END_RUNTIME } { Stats 'PowerPro process is using 112 MB, peak 172 MB, and 4 seconds [+1MB, +0MB, +0s] @ Tue Jul 13 11:46:23 2021' }
     [PPRO-SSSI]  { Stage PROTO_LOGIC_OPT BEGIN_RUNTIME } { Stats 'PowerPro process is using 112 MB, peak 172 MB, and 4 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:23 2021' }
     [PPRO-SSSI]  { Stage PROTO_LOGIC_OPT END_RUNTIME } { Stats 'PowerPro process is using 111 MB, peak 172 MB, and 4 seconds [-1MB, +0MB, +0s] @ Tue Jul 13 11:46:23 2021' }
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Infer flop enables                 4              172/111          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Optimize lib-modules               4              172/111          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Case Analysis Marking clock network          4              172/111          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Applying modes constraints          4              172/111          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Perform Case Analysis              4              172/111          0
 ------------------------------------------------------------------------------
     [PPRO-CGP]   Percentage of Clock Gated Flops, for design is: 99.45% (3428)
                  Please try 'help PPRO-CGP' for more detailed help.
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Move CGIC Enable To Flop           4              172/111          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Handling Constant Clocks           4              172/111          0
 ------------------------------------------------------------------------------
     [PPRO-SAICC] Clocks before Auto Infer Clocks Processing: '1' . Clocks after Auto Infer Clocks Processing : '0'
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Auto Infering Clocks               4              172/111          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Handling Complex Clocks            4              172/111          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Clock Definition Check             4              172/111          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Annotate CDIDs On All CGIC clock ports          4              172/111          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Clocked Data Ports Check           4              172/111          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 PA setup based on phy data          4              172/111          0
 ------------------------------------------------------------------------------
     [PA-NBCAS]    Dumping Name based Cap Annotation Stats : 
 For Cell Type : 0
 	  Total bit Ports : 3447 . Cap Annotated for Bit ports : 0 ( 0 % assertion ) 

 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Name Matching Based Cap Annotation          4              172/111          0
 ------------------------------------------------------------------------------
     [PPRO-SSSI]  { Stage PROTO_FLOP_CLK_GATED BEGIN_RUNTIME } { Stats 'PowerPro process is using 112 MB, peak 172 MB, and 4 seconds [+1MB, +0MB, +0s] @ Tue Jul 13 11:46:23 2021' }
     [PPRO-CGP]   Percentage of Clock Gated Flops, for design is: 99.45% (3428)
                  Please try 'help PPRO-CGP' for more detailed help.
     [PPRO-SSSI]  { Stage PROTO_FLOP_CLK_GATED END_RUNTIME } { Stats 'PowerPro process is using 112 MB, peak 172 MB, and 4 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:23 2021' }
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Loop detection                     4              172/111          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Bit Blast Constant Sinks           4              172/111          0
 ------------------------------------------------------------------------------
     [CDBO-PLRIH] Performing logic restructuring in hierarchy "top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000".
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Logic restructuring                4              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Mux tree optimization              4              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Logic optimization                 4              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Merge mux selects                  4              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Loop detection                     4              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Consistency Check                  4              172/112          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Consistency Check On PowerOpts          4              172/112          0
 ------------------------------------------------------------------------------
     [PPRO-SCTSO] Cumulative time spent for 'PLA' optimization is '0.011662'. Total number of calls made were '7'.
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Attributes on Constant Clocks          4              172/112          0
 ------------------------------------------------------------------------------
     [PPRO-SWLM]  Setting wireload_mode to top, previously it was none.
                  Please try 'help PPRO-SWLM' for more detailed help.
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Apply Wire load constraints          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Depth Assignment to Hierarchies          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Apply Set Driving Cell             4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Annotate CDIDs On All Clock Ports          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Process unreadable signals          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Process BlackBox Ports             4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Process unprintable VHDL nodes          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Dont Opt on Flops with Active Async Reset          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Process Resolution Mux             4              172/113          0
 ------------------------------------------------------------------------------
     [PPRO-SXDC]  The following are the characteristics of the design 'top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000'.
 Word-level instance count                    :       4496
 DP components                                :        155
 FFs                                          :        251
     [PPRO-FWDO]  Flops marked with the dont-optimize constraint: 0(0.00%)
     [PPRO-SWDU]  Signals marked with the stability dont-use constraint: 0(0.00%) Signals marked with the observability dont-use constraint: 0(0.00%)
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Design stats                       4              172/113          0
 ------------------------------------------------------------------------------
     [SCHEME-SMRS] PowerPro process is using 114 MB, peak 172 MB, and 4 seconds [+2MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021
     [SCHEME-SMC] Found "0" matches for scheme "two_flop_synch_2".
     [SCHEME-TSF] Total "0" 2-Flop synchronizers found in design.
     [SCHEME-SMRS] PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +1s] @ Tue Jul 13 11:46:24 2021
     [SCHEME-SMRS] PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021
     [SCHEME-SMC] Found "0" matches for scheme "common_enable".
     [SCHEME-SMC] Found "0" matches for scheme "common_select".
     [SCHEME-SMRS] PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021
     [SCHEME-SMRS] PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021
     [SCHEME-SMC] Found "0" matches for scheme "common_enable".
     [SCHEME-SMRS] PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Marking two-flop synchronizer          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Isolate Inout Callback Deregister          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Mark Dead Nodes                    4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Report Tech Cells                  4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Power Domain Constraints Marking          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Process Parallel Case Mux          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Apply constraints on Multicycle paths          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Power Opt Port Constraint Marking          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Set Default SA on Inout BBox Ports          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Mark clock fanin dont optimize constraints          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Warn if toggles accross a flop changes          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Mark Dont Optimize On Const Flops          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Mark Dont Opt constraints On Internal Flops          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Remove user enable from always enabled flops          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Disable resetting of global opt_cg_min_size after prototype_design          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Realising the set_boundary_opt constraints          4              172/113          0
 ------------------------------------------------------------------------------
     [PPRO-RMISN] Reset hierarchy instance name is modified from 'top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000_powerpro_reset_inst' to 'top_5_32_1_1_O_addr_type_L1_32_1_1_I_add' to honor STARC instance naming guidelines.
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Checking if the rtl is powerpro generated          4              172/113      36967
 ------------------------------------------------------------------------------
     [PPRO-SSSI]  { Stage BACK_PROPAGATE_USER_SA BEGIN_RUNTIME } { Stats 'PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021' }
     [PPRO-SSSI]  { Stage BACK_PROPAGATE_USER_SA END_RUNTIME } { Stats 'PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021' }
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Propagate User SA Across Buf/Inv and PowerPro black-boxes          4              172/113          0
 ------------------------------------------------------------------------------
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Checking Sanity of Supply Network Connections in UPF          4              172/113          0
 ------------------------------------------------------------------------------
     [PPRO-SSSI]  { Stage DUMP_DUT_HIER_JSON START_RUNTIME } { Stats 'PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021' }
     [PPRO-SSSI]  { Stage DUMP_DUT_HIER_JSON END_RUNTIME } { Stats 'PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021' }
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Generating PowerLeaks Data          4              172/113          0
 ------------------------------------------------------------------------------
     [PPRO-SSSI]  { Stage PROTO_OPTIMIZATION END_RUNTIME } { Stats 'PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021' }
     [PPRO-EGO]   Finished prototyping.
     [PPRO-GSF]   Design statistics after prototyping are as follows:
     [PPRO-SSSI]  { Stage PROTO_BATCHED_MEM_CTRL BEGIN_RUNTIME } { Stats 'PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021' }
     [PPRO-SSSI]  { Stage PROTO_BATCHED_MEM_CTRL END_RUNTIME } { Stats 'PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021' }
     [PPRO-SSSI]  { Stage PROTO_MEM_SUMMARY BEGIN_RUNTIME } { Stats 'PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021' }
     [PPRO-SSSI]  { Stage PROTO_SUMMARY BEGIN_RUNTIME } { Stats 'PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021' }

     [PPRO-PST]   
                  Please try 'help PPRO-PST' for more detailed help.
                  --------------------------------------------------------------
                  Total Flops                                      :   3447(100%)   
                  Total Data Latches                               :      0(0.00%)  
                  Always ON Flops                                  :     19(0.5512%)
                  Enabled Flops                                    :   3428(99.45%) 
                      Combinational Enabled Flops                  :   3428(99.45%) 
                      CGIC Enabled Flops                           :      0(0.00%)  
                  Clock Gating Efficiency                          :        90.67%   
                  --------------------------------------------------------------

     [PPRO-SSSI]  { Stage PROTO_SUMMARY END_RUNTIME } { Stats 'PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021' }
     [PPRO-NODF]  Total number of dead flops are: 1234.
     [PPRO-SCEF]  Total number of flops with efficiency in the range of [95.00% - 98.99%]: 277(8.04%).
     [PPRO-SCEF]  Total number of flops with efficiency in the range of [99.00% - 99.99%]: 2822(81.87%).
     [PPRO-SFEFC] Total number of flops with efficiency 100%: 0(0%).
     [PPRO-GDSF]  Design characteristics can be viewed from: '/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_pre_pwropt_v/characteristics.log'
     [PPRO-GDC]   Information about register arrays, gray boxes, data latches and dead flops can be viewed from: '/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_pre_pwropt_v/detail_characteristics.log'
     [PPRO-SSSIA] { Stage PROTO_SEQ_POWER START_RUNTIME } { Stats 'PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021' }
     [PA-ISPC]    Starting memory, register and sequential power computation.
     [PPRO-SSSI]  { Stage SEQ_POWER_COMPUTATION BEGIN_RUNTIME } { Stats 'PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021' }
<WRN>[ELEC-EWU]   Unsupported wire load mode: UNKNOWN.  Using wire load mode "top" instead.
                  Please try 'help ELEC-EWU' for more detailed help.
     [OPT-ENGF]   Number of clock-gated flip-flops during power estimation : 3390 (98.35%)
     [CDBT-CBFL]  CPL-GTL binding for lib context with id '2147483647' having constraints ''.
     [CDBT-CCTC]  "CPL_MUX_2" is bound to tech cell "GTL_MUX2_MUX2_X1".
     [CDBT-CCTC]  "CPL_CGIC_LATCH_POSEDGE_CTRL" is bound to tech cell "GTL_CGIC_LATCH_POSEDGE_CLKGATE_X1".
     [CDBT-CCTC]  "CPL_ANDOR" is bound to tech cell "GTL_ANDOR_OAI21_X1".
     [CDBT-CCTC]  "CPL_FULLADDER" is bound to tech cell "GTL_FULLADDER_FA_X1".
     [CDBT-CCTC]  "CPL_OR" is bound to tech cell "GTL_OR_OR2_X1".
     [CDBT-CCTC]  "CPL_XOR" is bound to tech cell "GTL_XOR_XOR2_X1".
     [CDBT-CCTC]  "CPL_NOT" is bound to tech cell "GTL_NOT_INV_X1".
     [CDBT-CCTC]  "CPL_BUF" is bound to tech cell "GTL_BUF_BUF_X1".
     [CDBT-CCTC]  "CPL_HALFADDER" is bound to tech cell "GTL_HALFADDER_HA_X1".
     [CDBT-CCTC]  "CPL_NAND" is bound to tech cell "GTL_NAND_NAND2_X1".
     [CDBT-NSFU]  Non scan flop 'DFF_X1' used for binding. This can happen if 'set_binding' command is used, or no scan flops are present in library or all scan flops are marked dont_use.
                  Please try 'help CDBT-NSFU' for more detailed help.
     [CDBT-CCTC]  "CPL_MACROFF" is bound to tech cell "GTL_FF_1000_DFF_X1".
     [CDBT-CCTC]  "CPL_MACROFF" is bound to tech cell "GTL_FF_1000_DFF_X1".
     [CDBT-CCTC]  "CPL_MACROFF" is bound to tech cell "GTL_FF_1001_DFFR_X1".
     [CDBT-CCTC]  "CPL_MACROFF" is bound to tech cell "GTL_FF_1010_DFFS_X1".
     [CDBT-CCTC]  "CPL_MACROFF" is bound to tech cell "GTL_FF_1011_DFFRS_X1".
     [CDBT-CCTC]  "CPL_AND" is bound to tech cell "GTL_AND_AND2_X1".
     [CDBT-CCTC]  "CPL_INV" is bound to tech cell "GTL_INV_INV_X1".
     [CDBT-CCTC]  "CPL_BEQ" is bound to tech cell "GTL_XNOR_XNOR2_X1".
     [CDBT-CCTC]  "CPL_NOR" is bound to tech cell "GTL_NOR_NOR2_X1".
     [CDBT-CCTC]  "CPL_NMACROFF" is bound to tech cell "GTL_NFF_1000_DFF_X1".
     [CDBT-CCTC]  "CPL_NMACROFF" is bound to tech cell "GTL_NFF_1000_DFF_X1".
     [CDBT-CCTC]  "CPL_NMACROFF" is bound to tech cell "GTL_NFF_1001_DFFR_X1".
     [CDBT-CCTC]  "CPL_NMACROFF" is bound to tech cell "GTL_NFF_1010_DFFS_X1".
     [CDBT-CCTC]  "CPL_NMACROFF" is bound to tech cell "GTL_NFF_1011_DFFRS_X1".
     [PA-SPCD]    Finished memory, register and sequential power computation.
     [PPRO-SSSI]  { Stage SEQ_POWER_COMPUTATION END_RUNTIME } { Stats 'PowerPro process is using 121 MB, peak 172 MB, and 5 seconds [+7MB, +0MB, +0s] @ Tue Jul 13 11:46:25 2021' }
 ------------------------------------------------------------------------------
 Xforms                        CPU(s)    Peak/InUse Mem(M)       Area  
 ------------------------------------------------------------------------------
 Calculate Sequential Power          5              172/120      36967
 ------------------------------------------------------------------------------
     [PPRO-SSSIA] { Stage PROTO_SEQ_POWER END_RUNTIME } { Stats 'PowerPro process is using 121 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:25 2021' }
     [PPRO-SSSI]  { Stage PROTO_MEM_CYCLE_REDUNDANCY BEGIN_RUNTIME } { Stats 'PowerPro process is using 121 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:25 2021' }
     [PPRO-CCBGI] CGSim: No waveform file has been read, therefore terminating cycle based redundancy reports generation.
     [PPRO-CCBGI] CGSim: There is no summary information for memory cycle based redundancy.
     [PPRO-CCBGI] CGSim: There is no reporting information for memory cycle based redundancy reporting.
     [PPRO-SSSI]  { Stage PROTO_MEM_CYCLE_REDUNDANCY END_RUNTIME } { Stats 'PowerPro process is using 121 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:25 2021' }
     [UI-STATS]   PowerPro process is using 121 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:25 2021

     [PPRO-SSSI]  { Stage PROTO_WRITE_DB START_RUNTIME } { Stats 'PowerPro process is using 121 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:25 2021' }
     [PPRO-SSSI]  { Stage PROTO_WRITE_DB END_RUNTIME } { Stats 'PowerPro process is using 121 MB, peak 172 MB, and 6 seconds [+0MB, +0MB, +1s] @ Tue Jul 13 11:46:25 2021' }
     [PPRO-SSSI]  { Stage PROTO_VERIFY_SCRIPT START_RUNTIME } { Stats 'PowerPro process is using 121 MB, peak 172 MB, and 6 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:25 2021' }
     [PPRO-WVSB]  Writing verification script in '/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_pre_pwropt_v/self_verify'.
     [PPRO-WVSSD] Creating output directory '/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_pre_pwropt_v/self_verify'.
     [PPRO-WSSB]  Writing verification script '/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_pre_pwropt_v/self_verify/self_verify_script.tcl'.
     [PPRO-WSSDT] Design top will be 'top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000'.
     [PPRO-WSSCR] SLEC will assume clock port on 'clk'.
     [PPRO-WSSFP] SLEC will verify full-proof.
     [PPRO-WSSE]  Finished writing SLEC script.
     [PPRO-SSSI]  { Stage PROTO_VERIFY_SCRIPT END_RUNTIME } { Stats 'PowerPro process is using 121 MB, peak 172 MB, and 6 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:25 2021' }
     [PPRO-SSSI]  { Stage PROTO_MG_TECHNICIAN START_RUNTIME } { Stats 'PowerPro process is using 121 MB, peak 172 MB, and 6 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:25 2021' }
     [PPRO-GPI]   OptTechnician report_proto start : PowerPro process is using 121 MB, peak 172 MB, and 6 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:25 2021
     [PPRO-GPI]   OptTechnician report_proto end : PowerPro process is using 121 MB, peak 172 MB, and 6 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:25 2021
     [PPRO-OTRD]  The debugging information for the stage "prototype_design" has been written to the "/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_pre_pwropt_v/opt_technician.log" file. To see hints for debugging your setup at respective stages, refer the log file.
     [PPRO-SSSI]  { Stage PROTO_MG_TECHNICIAN END_RUNTIME } { Stats 'PowerPro process is using 121 MB, peak 172 MB, and 6 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:25 2021' }
     [PPRO-SSSI]  { Stage PROTO END_RUNTIME } { Stats 'PowerPro process is using 122 MB, peak 172 MB, and 6 seconds [+1MB, +0MB, +0s] @ Tue Jul 13 11:46:26 2021' }
     [UI-STATS]   PowerPro process is using 122 MB, peak 172 MB, and 6 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:26 2021

powerpro> set_powerpro_reset -synchronizer_needed no -target_clock CLOCKclk -target_polarity pos -active_high -sync rst
<WRN>[PPRO-SPPWC] Specified reset port 'rst' has no clock associated with it.
                  Please try 'help PPRO-SPPWC' for more detailed help.
     [PPRO-SDFFC] Total Flops marked as dont opt(bit-level): '0'.
powerpro> report_power
     [PA-ISPC]    Starting memory, register and sequential power computation.
     [PPRO-SSSI]  { Stage SEQ_POWER_COMPUTATION BEGIN_RUNTIME } { Stats 'PowerPro process is using 123 MB, peak 172 MB, and 6 seconds [+1MB, +0MB, +0s] @ Tue Jul 13 11:46:26 2021' }
     [PA-PCPAC]   'RegPower' is already computed
     [OPT-CPCF]   All the paths have been collected for the clock tree synthesis.
     [OPT-CHE]    Separate hierarchy for the clock tree has been extracted.
     [CDB-LBSI]   Started execution of _break_comb_loop's intermediate stage "Break Comb Loop". Stats "PowerPro process is using 125 MB, peak 172 MB, and 6 seconds [+2MB, +0MB, +0s] @ Tue Jul 13 11:46:26 2021".
     [CDB-CCLBE]  Number of anchor points found in design is '0'.
     [CDB-CCLBB]  Number of comb loop blackboxes is '0'.
     [CDB-LBSI]   Finished execution of _break_comb_loop's intermediate stage "Break Comb Loop". Stats "PowerPro process is using 125 MB, peak 172 MB, and 6 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:26 2021".
     [OPT-CHS]    The clock tree hierarchy has been simplified.
     [OPT-CBD]    The clock tree has been balanced.
     [OPT-CSCF]   Sanity check result for the clock tree synthesis : PASS .
     [OPT-CPR]    The clock power for the clock root is 
Index: 0
Leakage Power                  :  0.00292816
Internal Power                 :  0.0185476
Net Power (including CGIC Nets):  0.109145
     [OPT-DCPR]   The clock power for the design is 
Design Clock Leakage Power                  :  0.00292816
Design Clock Internal Power                 :  0.0185476
Design Clock Net Power (including CGIC nets):  0.109145
     [PA-GPI]     Clock tree power numbers for debug only...at once : 0.130621 :: multiple calls (wo power_scaling) :: 0.130621

     [OPT-DSPR]   The sequential power for the design is 
Design Sequential Leakage Power :  0.00563936
Design Sequential Internal Power:  0.073421
Design Sequential Net Power     :  0.0239324

     [PA-GPI]     CGIC tree power numbers for debug only...at once : 0.102993

     [PA-NLSF]    Scaling factors for cell leakage power in the .lib file are missing or have a '0' value. Leakage power numbers will be used as-is.
                  Please try 'help PA-NLSF' for more detailed help.

                  (Subsequent repetitions of this message will be suppressed.
                   Use 'enable_msg PA-NLSF' to show all repetitions.)

     [PPRO-CTSF]  Finished clock tree synthesis.
     [PA-CTPC]    The clock tree power got computed successfully.
                  Please try 'help PA-CTPC' for more detailed help.
     [PA-SPCD]    Finished memory, register and sequential power computation.
     [PPRO-SSSI]  { Stage SEQ_POWER_COMPUTATION END_RUNTIME } { Stats 'PowerPro process is using 123 MB, peak 172 MB, and 6 seconds [-2MB, +0MB, +0s] @ Tue Jul 13 11:46:26 2021' }
     [PA-ICPC]    Starting combinational power computation.
     [PPRO-SSSI]  { Stage COMB_POWER_COMPUTATION BEGIN_RUNTIME } { Stats 'PowerPro process is using 123 MB, peak 172 MB, and 6 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:26 2021' }
<WRN>[STA-SGTM]   Cleaning up excessive timing graphs in design. (This may occur more than once, but this message will be issued at most one time per session.)
                  Please try 'help STA-SGTM' for more detailed help.
     [PA-CPCD]    Finished combinational power computation.
     [PPRO-SSSI]  { Stage COMB_POWER_COMPUTATION END_RUNTIME } { Stats 'PowerPro process is using 127 MB, peak 198 MB, and 14 seconds [+4MB, +26MB, +8s] @ Tue Jul 13 11:46:34 2021' }
     [PA-WDIRP]   Writing the database as '/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_pre_pwropt_v/chkpt_proto_power.db'
     [PA-NPC]     Net Power of the top-module/instance 'top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000' : 90.7561 uW.
     [PA-TMAR]    Area of the top-module/instance 'top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000' after tech-mapping : 26853.6
     [PPRO-PES]   Generating power summary report.
+-----------------------------------------------------------------------------------+
|                                                                                   |
| Generated by PowerPro-10.3c_2/849904   (Jan 10 2020)  linux64  P2001101230        |
| on Tue Jul 13 11:46:35 2021.                                                      |
|                                                                                   |
| This document may be used and distributed without restriction provided that       |
| this copyright statement is not removed from the file and that any derivative     |
| work contains this copyright notice.                                              |
|                                                                                   |
+-----------------------------------------------------------------------------------+

Library(s) Used:
  NangateOpenCellLibrary


Operating Conditions    : typical
Wireload Mode           : top
  ---------------------------------------------------------------------------------------------------------------------------
  Design                    | Target Libraries        | Voltage | Wireload Model  | Library for Wireload | VTH Distribution 
  ---------------------------------------------------------------------------------------------------------------------------
  top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000  All                       1.1       5K_hvratio_1_1    NangateOpenCellLibrary                                                    
  top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000001.topless_5comma_32comma_1comma_1comma_O_addr_type_L1comma_32comma_1comma_1comma_I_addr_type_L1comma_32comma_1comma_1comma_W_addr_type_L1comma_5comma_288comma_8comma_8comma_O_addr_type_L2comma_312comma_8comma_8comma_I_addr_type_L2c000000  All                       1.1       5K_hvratio_1_1    NangateOpenCellLibrary                                                    

  ---------------------------------------------------------------------------------------------------------------------------

Global Operating Voltage = 1.1
Power-specific unit information:
  Voltage Units         = 1V
  Capacitance Units     = 1ff
  Time Units            = 1ns
  Switching Power Units = 1uW
  Dynamic Power Units   = 1uW
  Leakage Power Units   = 1uW

Scaling Factor :
  N/A


Power Group Description: 
  ----------------------------------------------------------------------------------------------------
  Power Group           |  Description
  ----------------------------------------------------------------------------------------------------
  io_pad                |  Specifies power consumption for all input-output pads in the design.
  memory                |  Specifies power consumption for all identified memory objects.
  black_box             |  Specifies power consumption for all black box objects.
  register              |  Specifies power consumption for all flop and data latch objects.
  combinational         |  Specifies power consumption for all combinational gate objects which
                        |  are not part of clock network.
  sequential            |  Specifies power consumption for all CGIC and clock network latch objects 
                        |  (only if global pa_clock_network_include_cgics is set as 0).
  clock_network         |  Specifies power consumption for all objects which are part of clock 
                        |  network. CGIC and latch power is excluded if global pa_clock_network_include_cgics 
                        |  is set as 0.
  total                 |  Specifies the total power of the design.
  ----------------------------------------------------------------------------------------------------

Power Summary Report
-------------------------------------------------------------------------------------------------------------------------------------
Power Group    Count          Leakage Power(uW)     Internal Power(uW)    Switching Power(uW)   Total Power(uW)       Percentage(%)  
-------------------------------------------------------------------------------------------------------------------------------------
io_pad         0              0                     0                     0                     0                     0%             
memory         0              0                     0                     0                     0                     0%             
black_box      0              0                     0                     0                     0                     0%             
register       3447           273.411               271.393               7.55348               552.358               48.01%         
combinational  10043          245.707               59.5821               83.2026               388.492               33.77%         
sequential     0              0                     0                     0                     0                     0%             
clock_network  194            8.56752               91.9687               109.145               209.682               18.22%         
total          13684          527.686               422.944               199.901               1150.53               100%           

<WRN>[PHY-SNHM]   Number of hits : 0. Number of miss : 0.
     [PQI-QEXE]   QEXE : 'compute_reports -caller report_power'.
     [PPRO-SSSI]  { Stage COMPUTE_REPORTS_AT_REPORT_POWER BEGIN_RUNTIME } { Stats 'PowerPro process is using 127 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +1s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-MGR]   Generating Design Statistics and Design Power reports
     [PPRO-MGR]   Generating 'Hierarchical Efficiency' report...
     [PPRO-SSSI]  { Stage HIERARCHICAL_EFFICIENCY BEGIN_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+1MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-SSSI]  { Stage HIERARCHICAL_EFFICIENCY END_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-MGR]   'Memory Efficiency' report can't be generated, no memory found in design.
     [PPRO-MGR]   Generating 'User Enabled Flops' report...
     [PPRO-SSSI]  { Stage USER_ENABLED_FLOPS BEGIN_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-SSSI]  { Stage USER_ENABLED_FLOPS END_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-SSSI]  { Stage GENERATE_DEFAULT_PA_REPORTS BEGIN_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-MGR]   Generating 'Power Summary' report...
     [PPRO-SSSI]  { Stage POWER_SUMMARY BEGIN_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-SSSI]  { Stage POWER_SUMMARY END_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-MGR]   Generating 'Hierarchical Power' report...
     [PPRO-SSSI]  { Stage HIERARCHICAL_POWER BEGIN_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-SSSI]  { Stage HIERARCHICAL_POWER END_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-MGR]   Generating 'Hierarchical Clock Power' report...
     [PPRO-SSSI]  { Stage HIERARCHICAL_CLOCK_POWER BEGIN_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-SSSI]  { Stage HIERARCHICAL_CLOCK_POWER END_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-SSSI]  { Stage GENERATE_DEFAULT_PA_REPORTS END_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-MGR]   Generating 'Clock Tree Stats' report...
     [PPRO-SSSI]  { Stage CLOCK_TREE_STATS BEGIN_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-SSSI]  { Stage CLOCK_TREE_STATS END_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-SSSI]  { Stage FLOP_REPORT BEGIN_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-SSSI]  { Stage FLOP_REPORT END_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-SSSI]  { Stage HIER_REPORT BEGIN_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-SSSI]  { Stage HIER_REPORT END_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [PPRO-SSSI]  { Stage COMPUTE_REPORTS_AT_REPORT_POWER END_RUNTIME } { Stats 'PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021' }
     [UI-STATS]   PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021

powerpro> __pa_cmd_get_pow_detail
{ mem_dynamic_power 0 reg_dynamic_power 271.393 comb_dynamic_power 59.5821 seq_dynamic_power 73.4211 clk_network_dynamic_power 18.5476 bbox_dynamic_power 0 io_pad_dynamic_power 0 mem_leakage_power 0 reg_leakage_power 273.411 comb_leakage_power 245.707 seq_leakage_power 5.63936 clk_network_leakage_power 2.92816 bbox_leakage_power 0 io_pad_leakage_power 0 mem_net_power 0 reg_net_power 7.55348 comb_net_power 83.2026 seq_net_power 23.9324 clk_network_net_power 85.213 bbox_net_power 0 io_pad_net_power 0 report_hier_dyn_power 422.944 report_hier_lkg_power 527.686 report_hier_net_power 199.901 report_hier_tot_power 1150.53 percentage 100  }

powerpro> get_sa_coverage -sequential
100%

powerpro> get_sa_coverage -user_nets
100%

powerpro> __pa_cmd_get_pow_detail -hier_instance top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000001
{ mem_dynamic_power 0 reg_dynamic_power 271.393 comb_dynamic_power 59.5821 seq_dynamic_power 73.4211 clk_network_dynamic_power 18.5476 bbox_dynamic_power 0 io_pad_dynamic_power 0 mem_leakage_power 0 reg_leakage_power 273.411 comb_leakage_power 245.707 seq_leakage_power 5.63936 clk_network_leakage_power 2.92816 bbox_leakage_power 0 io_pad_leakage_power 0 mem_net_power 0 reg_net_power 7.55348 comb_net_power 82.9139 seq_net_power 23.9324 clk_network_net_power 84.9603 bbox_net_power 0 io_pad_net_power 0 report_hier_dyn_power 422.944 report_hier_lkg_power 527.686 report_hier_net_power 199.36 report_hier_tot_power 1149.99 percentage 99.95  }

powerpro> __pa_cmd_get_pow_detail -cleanup
3 warning, 0 error messages
14.682u 0.677s 15.359 0:17.000   113.921m 198.352p
(PowerPro process used 198 MB and 15 seconds)
