+-----------------------------------------------------------------------+
|                                                                       |
|                                                                       |
|                             MENTOR(tm)                                |
|                                                                       |
|                       PowerPro(tm) Software                           |
|                                                                       |
|                                                                       |
| This program contains confidential, trade secret information of       |
| Mentor Graphics Corporation.  Any reproduction, use or disclosure     |
| of this program, including any attempt to obtain a human-readable     |
| version of this program, without the express, prior written consent   |
| of Mentor Graphics Corporation is strictly prohibited.                |
|                                                                       |
|       Copyright (c) 2002 - 2019, Mentor Graphics Corporation          |
|                         All rights reserved.                          |
|                                                                       |
| Mentor acknowledges trademarks or registered trademarks of other      |
| organizations for their respective products and services.             |
|                                                                       |
| PowerPro-10.3c_2/849904   (Jan 10 2020)  linux64  P2001101230         |
|                                                                       |
|                                                                       |
| 64-bit mode                                                           |
| CentOS Linux release 8.4.2105 x86_64                                  |
| Intel(R) Xeon(R) CPU E5-2690 v3 @ 2.60GHz x 48                        |
| 396150728 kB                                                          |
| amazone.esat.kuleuven.be                     Tue Jul 13 11:46:19 2021 |
|                                                                       |
+-----------------------------------------------------------------------+
Command-line: /esat/micas-data/software/Mentor/catapult_10.5c/pkgs/cds_ppro/rls/bin/powerpro -connect 1439 -64 -cg -workdir /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_pre_pwropt_v

     [APP-SCP]    Setting the currently running product to PowerPro CG.

  
	License daemon :	mgcld
	License file :		
	Following are the checked out license features :
		PProBase PProAnalysis PProCGopt PProWriteRTL
<WRN>[PPRO-FRNL]  Cannot use the 'read_fsdb' command in the current session because the shell environment variable 'NOVAS_LD_LIBRARY_PATH' has not been set. To use the command, set the environment variable to specify the directory location that contains the latest version of the dynamic library files libnffr.so and libnsys.so and try again.
                  Please try 'help PPRO-FRNL' for more detailed help.
     [PPRO-EVND]  Environment variable 'PPRO_QUESTA_HOME' not defined.
     [PPRO-EVND]  Environment variable 'PPRO_VISUALIZER_HOME' not defined.
<WRN>[PPRO-VVVM]  Cannot find the required version of Visualizer.
                  Please try 'help PPRO-VVVM' for more detailed help.
<WRN>[PPRO-VQVM]  Cannot find the required version of Questa Sim.
                  Please try 'help PPRO-VQVM' for more detailed help.
powerpro> get_global build_ident
PowerPro-10.3c_2/849904   (Jan 10 2020)  linux64  P2001101230

powerpro> cd /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF
powerpro> set_powerpro_mode power_analysis
powerpro> set_global message_wrap_at 10000
10000

powerpro> set_global fsdb_lib_version 17
17

powerpro> config_write_rtl -use_iterative_write_rtl yes
powerpro> config_write_rtl -enlogic_file_naming_scheme top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000_enLogic
powerpro> config_write_rtl -vhdl_new_logic_package_name top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000_calypto_package
powerpro> config_write_rtl -vhdl_tc_package_name top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000_powerpro_tc_package
powerpro> config_write_rtl -generate_X_aware_enable no
powerpro> set_global __idcsa_filt_ff_intercept 0.01
0.01

powerpro> set_global __idcsa_filt_support_intercept 0.01
0.01

powerpro> set_global __idcsa_filt_combnode_intercept 0.01
0.01

powerpro> read_library /esat/micas-data/software/Mentor/catapult_10.5c/pkgs/siflibs/nangate/nangate45nm_nldm.lib
     [PPRO-SOC]   Setting the operating condition 'typical' from the library 'NangateOpenCellLibrary' as the active 'operating_condition' for the design. Specifying the values for process as '1', temperature as '25' and voltage as '1.1'. Use the 'set_operating_condition' command to explicitly specify the default operating condition.
     [CDBL-LRS]   Library "/esat/micas-data/software/Mentor/catapult_10.5c/pkgs/siflibs/nangate/nangate45nm_nldm.lib" read successfully.
     [UI-STATS]   PowerPro process is using 59 MB, peak 95 MB, and 1 seconds [+59MB, +95MB, +1s] @ Tue Jul 13 11:46:20 2021
powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000001.v
     [UI-BDLM]    Please refer to /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_pre_pwropt_v/build_design.log for a comprehensive list of messages and warnings issued in build_design. These may provide hints for debugging issues (if any) related to performance, potential out of bound accesses etc.

                  (Subsequent repetitions of this message will be suppressed.
                   Use 'enable_msg UI-BDLM' to show all repetitions.)

     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 100 MB, and 1 seconds [+38MB, +5MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000003.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 100 MB, and 1 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000005.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 100 MB, and 1 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000007.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 100 MB, and 1 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000009.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 100 MB, and 1 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000005_1.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 101 MB, and 1 seconds [+0MB, +1MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000005_2.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 102 MB, and 1 seconds [+0MB, +1MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000005_3.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 102 MB, and 1 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000005_4.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 97 MB, peak 102 MB, and 1 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000005_5.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 98 MB, peak 102 MB, and 1 seconds [+1MB, +0MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> read_design -verilog /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/./prepwr_top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_p000000.v
     [CPT-RDF]    Reading design files into the 'work' design library.
     [UI-STATS]   PowerPro process is using 100 MB, peak 104 MB, and 1 seconds [+2MB, +2MB, +0s] @ Tue Jul 13 11:46:20 2021

powerpro> link_design -top top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000
     [CPT-LDF]    Linking the 'work' design library.
     [CPT-RDFD]   RTL design files dump enabled.
     [UI-STATS]   PowerPro process is using 123 MB, peak 156 MB, and 1 seconds [+23MB, +52MB, +0s] @ Tue Jul 13 11:46:21 2021

     [UI-STATS]   PowerPro process is using 123 MB, peak 156 MB, and 1 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:21 2021

1

powerpro> build_db
     [CPT-STN]    Synthesizing the 'work' design library.
     [CDB-STH]    Setting 'top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000' as the top module of the 'work' design library.
     [CPT-FBD]    Finished synthesizing the 'work' design library.
     [UI-STATS]   PowerPro process is using 87 MB, peak 156 MB, and 2 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:21 2021

powerpro> set_operating_condition typical -library NangateOpenCellLibrary
     [PPRO-SOC]   Setting the operating condition 'typical' from the library 'NangateOpenCellLibrary' as the active 'operating_condition' for the design. Specifying the values for process as '1', temperature as '25' and voltage as '1.1'. Use the 'set_operating_condition' command to explicitly specify the default operating condition.
powerpro> set_wire_load_mode top
     [PPRO-WLCS]  Storing constraint for command 'set_wire_load_mode', to be applied later in the flow.
                  Please try 'help PPRO-WLCS' for more detailed help.
powerpro> create_clock -name CLOCKclk -period 10.0 clk
     [STA-SCCOP]  Created a clock with name 'CLOCKclk' on port 'clk'.
powerpro> read_saif -name_divider / -instance_name scverify_top/rtl /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/switching_v/default.saif
     [PA-PRSF]    Reading SAIF File : "/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/switching_v/default.saif".
     [PA-PSSIN]   Start instance in Saif file : scverify_top.rtl. Start design instance : Top Level Module
     [PA-RSS]     
                  ------------------------------------------------------------
                  Total Primary Inputs/Inouts            : 542 (100%)
                  Asserted Primary Inputs/Inouts         : 542 (100%)
                  ------------------------------------------------------------
                  Total Flop Outputs                     : 3447 (100%)
                  Asserted Flop Outputs                  : 3447 (100%)
                  Asserted Flop Clock Ports              : 3447 (100%)
                  Total CGIC Output Ports                : 0 (0%)
                  Asserted CGIC Output Ports             : 0 (0%)
                  ------------------------------------------------------------
                  Total Memories                         : 0 (0%)
                  Memories With All Inputs Asserted      : 0 (0%)
                  Memories With All Outputs Asserted     : 0 (0%)
                  Memories With All Clock Ports Asserted : 0 (0%)
                  ------------------------------------------------------------
                  Total Data Path Operators                    : 7 (100%)
                  Total Data Path Operators with Any Input User Net : 7 (100%)
                  Data Path Operators With All Inputs Asserted : 7 (100%)
                  Total Data Path Operators with Any Output User Net: 7 (100%)
                  Data Path Operators With All Outputs Asserted: 7 (100%)
                  ------------------------------------------------------------
                  Total IO Pad Cells                    : 0 (0%)
                  IO Pad Cells With All Inputs Asserted : 0 (0%)
                  IO Pad Cells With All Outputs Asserted: 0 (0%)
                  ------------------------------------------------------------
                  Total Nets                             : 17459 (100%)
                  User Nets                              : 7424 (42.52%)
                  Asserted User Nets                     : 7424 (100%)
                  ------------------------------------------------------------

                  Please try 'help PA-RSS' for more detailed help.
powerpro> config_clock_tree -buffer BUF_X2 -fanout 16 -root_buffer BUF_X2 -root_buffer_fanout 8 -final_buffer BUF_X2 -final_buffer_fanout 32
     [PPRO-CCTFV] Clock tree fanout is set to 16.
     [PPRO-CCTFV] Clock tree final_buffer_fanout is set to 32.
     [PPRO-CCTFV] Clock tree root_buffer_fanout is set to 8.
     [PPRO-CCTFV] Clock tree buffer is set to BUF_X2.
     [PPRO-CCTFV] Clock tree final_buffer is set to BUF_X2.
     [PPRO-CCTFV] Clock tree root_buffer is set to BUF_X2.
     [PPRO-CTC]   Clock tree configuration is saved for power analysis.
powerpro> ::get_version
10.3c_2

powerpro> prototype_design
     [PPRO-SGO]   Prototyping 'top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000'.
     [UI-STATS]   PowerPro process is using 100 MB, peak 172 MB, and 3 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:22 2021
     [PPRO-SWLM]  Setting wireload_mode to top, previously it was none.
                  Please try 'help PPRO-SWLM' for more detailed help.
     [PPRO-FWDO]  Flops marked with the dont-optimize constraint: 0(0.00%)
     [PPRO-SWDU]  Signals marked with the stability dont-use constraint: 0(0.00%) Signals marked with the observability dont-use constraint: 0(0.00%)
     [SCHEME-TSF] Total "0" 2-Flop synchronizers found in design.
     [PPRO-RMISN] Reset hierarchy instance name is modified from 'top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000_powerpro_reset_inst' to 'top_5_32_1_1_O_addr_type_L1_32_1_1_I_add' to honor STARC instance naming guidelines.
     [PPRO-EGO]   Finished prototyping.
     [PPRO-GSF]   Design statistics after prototyping are as follows:

     [PPRO-PST]   
                  Please try 'help PPRO-PST' for more detailed help.
                  --------------------------------------------------------------
                  Total Flops                                      :   3447(100%)   
                  Total Data Latches                               :      0(0.00%)  
                  Always ON Flops                                  :     19(0.5512%)
                  Enabled Flops                                    :   3428(99.45%) 
                      Combinational Enabled Flops                  :   3428(99.45%) 
                      CGIC Enabled Flops                           :      0(0.00%)  
                  Clock Gating Efficiency                          :        90.67%   
                  --------------------------------------------------------------

     [PPRO-NODF]  Total number of dead flops are: 1234.
     [PPRO-SCEF]  Total number of flops with efficiency in the range of [95.00% - 98.99%]: 277(8.04%).
     [PPRO-SCEF]  Total number of flops with efficiency in the range of [99.00% - 99.99%]: 2822(81.87%).
     [PPRO-SFEFC] Total number of flops with efficiency 100%: 0(0%).
     [PPRO-GDSF]  Design characteristics can be viewed from: '/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_pre_pwropt_v/characteristics.log'
     [PPRO-GDC]   Information about register arrays, gray boxes, data latches and dead flops can be viewed from: '/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_pre_pwropt_v/detail_characteristics.log'
     [PPRO-SSSIA] { Stage PROTO_SEQ_POWER START_RUNTIME } { Stats 'PowerPro process is using 114 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:24 2021' }
     [PA-ISPC]    Starting memory, register and sequential power computation.
     [OPT-ENGF]   Number of clock-gated flip-flops during power estimation : 3390 (98.35%)
     [PA-SPCD]    Finished memory, register and sequential power computation.
     [PPRO-SSSIA] { Stage PROTO_SEQ_POWER END_RUNTIME } { Stats 'PowerPro process is using 121 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:25 2021' }
     [UI-STATS]   PowerPro process is using 121 MB, peak 172 MB, and 5 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:25 2021

     [PPRO-WSSB]  Writing verification script '/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_pre_pwropt_v/self_verify/self_verify_script.tcl'.
     [PPRO-OTRD]  The debugging information for the stage "prototype_design" has been written to the "/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_pre_pwropt_v/opt_technician.log" file. To see hints for debugging your setup at respective stages, refer the log file.
     [UI-STATS]   PowerPro process is using 122 MB, peak 172 MB, and 6 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:26 2021

powerpro> set_powerpro_reset -synchronizer_needed no -target_clock CLOCKclk -target_polarity pos -active_high -sync rst
powerpro> report_power
     [PA-ISPC]    Starting memory, register and sequential power computation.
     [PA-NLSF]    Scaling factors for cell leakage power in the .lib file are missing or have a '0' value. Leakage power numbers will be used as-is.
                  Please try 'help PA-NLSF' for more detailed help.

                  (Subsequent repetitions of this message will be suppressed.
                   Use 'enable_msg PA-NLSF' to show all repetitions.)

     [PPRO-CTSF]  Finished clock tree synthesis.
     [PA-SPCD]    Finished memory, register and sequential power computation.
     [PA-ICPC]    Starting combinational power computation.
     [PA-CPCD]    Finished combinational power computation.
     [PPRO-PES]   Generating power summary report.
+-----------------------------------------------------------------------------------+
|                                                                                   |
| Generated by PowerPro-10.3c_2/849904   (Jan 10 2020)  linux64  P2001101230        |
| on Tue Jul 13 11:46:35 2021.                                                      |
|                                                                                   |
| This document may be used and distributed without restriction provided that       |
| this copyright statement is not removed from the file and that any derivative     |
| work contains this copyright notice.                                              |
|                                                                                   |
+-----------------------------------------------------------------------------------+

Library(s) Used:
  NangateOpenCellLibrary


Operating Conditions    : typical
Wireload Mode           : top
  ---------------------------------------------------------------------------------------------------------------------------
  Design                    | Target Libraries        | Voltage | Wireload Model  | Library for Wireload | VTH Distribution 
  ---------------------------------------------------------------------------------------------------------------------------
  top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000  All                       1.1       5K_hvratio_1_1    NangateOpenCellLibrary                                                    
  top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000001.topless_5comma_32comma_1comma_1comma_O_addr_type_L1comma_32comma_1comma_1comma_I_addr_type_L1comma_32comma_1comma_1comma_W_addr_type_L1comma_5comma_288comma_8comma_8comma_O_addr_type_L2comma_312comma_8comma_8comma_I_addr_type_L2c000000  All                       1.1       5K_hvratio_1_1    NangateOpenCellLibrary                                                    

  ---------------------------------------------------------------------------------------------------------------------------

Global Operating Voltage = 1.1
Power-specific unit information:
  Voltage Units         = 1V
  Capacitance Units     = 1ff
  Time Units            = 1ns
  Switching Power Units = 1uW
  Dynamic Power Units   = 1uW
  Leakage Power Units   = 1uW

Scaling Factor :
  N/A


Power Group Description: 
  ----------------------------------------------------------------------------------------------------
  Power Group           |  Description
  ----------------------------------------------------------------------------------------------------
  io_pad                |  Specifies power consumption for all input-output pads in the design.
  memory                |  Specifies power consumption for all identified memory objects.
  black_box             |  Specifies power consumption for all black box objects.
  register              |  Specifies power consumption for all flop and data latch objects.
  combinational         |  Specifies power consumption for all combinational gate objects which
                        |  are not part of clock network.
  sequential            |  Specifies power consumption for all CGIC and clock network latch objects 
                        |  (only if global pa_clock_network_include_cgics is set as 0).
  clock_network         |  Specifies power consumption for all objects which are part of clock 
                        |  network. CGIC and latch power is excluded if global pa_clock_network_include_cgics 
                        |  is set as 0.
  total                 |  Specifies the total power of the design.
  ----------------------------------------------------------------------------------------------------

Power Summary Report
-------------------------------------------------------------------------------------------------------------------------------------
Power Group    Count          Leakage Power(uW)     Internal Power(uW)    Switching Power(uW)   Total Power(uW)       Percentage(%)  
-------------------------------------------------------------------------------------------------------------------------------------
io_pad         0              0                     0                     0                     0                     0%             
memory         0              0                     0                     0                     0                     0%             
black_box      0              0                     0                     0                     0                     0%             
register       3447           273.411               271.393               7.55348               552.358               48.01%         
combinational  10043          245.707               59.5821               83.2026               388.492               33.77%         
sequential     0              0                     0                     0                     0                     0%             
clock_network  194            8.56752               91.9687               109.145               209.682               18.22%         
total          13684          527.686               422.944               199.901               1150.53               100%           

     [UI-STATS]   PowerPro process is using 128 MB, peak 198 MB, and 15 seconds [+0MB, +0MB, +0s] @ Tue Jul 13 11:46:35 2021

powerpro> __pa_cmd_get_pow_detail
{ mem_dynamic_power 0 reg_dynamic_power 271.393 comb_dynamic_power 59.5821 seq_dynamic_power 73.4211 clk_network_dynamic_power 18.5476 bbox_dynamic_power 0 io_pad_dynamic_power 0 mem_leakage_power 0 reg_leakage_power 273.411 comb_leakage_power 245.707 seq_leakage_power 5.63936 clk_network_leakage_power 2.92816 bbox_leakage_power 0 io_pad_leakage_power 0 mem_net_power 0 reg_net_power 7.55348 comb_net_power 83.2026 seq_net_power 23.9324 clk_network_net_power 85.213 bbox_net_power 0 io_pad_net_power 0 report_hier_dyn_power 422.944 report_hier_lkg_power 527.686 report_hier_net_power 199.901 report_hier_tot_power 1150.53 percentage 100  }

powerpro> get_sa_coverage -sequential
100%

powerpro> get_sa_coverage -user_nets
100%

powerpro> __pa_cmd_get_pow_detail -hier_instance top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000001
{ mem_dynamic_power 0 reg_dynamic_power 271.393 comb_dynamic_power 59.5821 seq_dynamic_power 73.4211 clk_network_dynamic_power 18.5476 bbox_dynamic_power 0 io_pad_dynamic_power 0 mem_leakage_power 0 reg_leakage_power 273.411 comb_leakage_power 245.707 seq_leakage_power 5.63936 clk_network_leakage_power 2.92816 bbox_leakage_power 0 io_pad_leakage_power 0 mem_net_power 0 reg_net_power 7.55348 comb_net_power 82.9139 seq_net_power 23.9324 clk_network_net_power 84.9603 bbox_net_power 0 io_pad_net_power 0 report_hier_dyn_power 422.944 report_hier_lkg_power 527.686 report_hier_net_power 199.36 report_hier_tot_power 1149.99 percentage 99.95  }

powerpro> __pa_cmd_get_pow_detail -cleanup
3 warning, 0 error messages
14.682u 0.677s 15.359 0:17.000   113.921m 198.352p
(PowerPro process used 198 MB and 15 seconds)
