+-----------------------------------------------------------------------+
|                                                                       |
|                                                                       |
|                             MENTOR(tm)                                |
|                                                                       |
|                         SLEC(tm) Software                             |
|                                                                       |
|                          Enabling ESL(tm)                             |
|                                                                       |
|                                                                       |
| This program contains confidential, trade secret information of       |
| Mentor Graphics Corporation.  Any reproduction, use or disclosure     |
| of this program, including any attempt to obtain a human-readable     |
| version of this program, without the express, prior written consent   |
| of Mentor Graphics Corporation is strictly prohibited.                |
|                                                                       |
|       Copyright (c) 2002 - 2019, Mentor Graphics Corporation          |
|                         All rights reserved.                          |
|                                                                       |
| Mentor acknowledges trademarks or registered trademarks of other      |
| organizations for their respective products and services.             |
|                                                                       |
| SLEC-10.3c_2/849904   (Jan 10 2020)  linux64  P2001101230             |
|                                                                       |
|                                                                       |
| 64-bit mode                                                           |
| CentOS Linux release 8.4.2105 x86_64                                  |
| Intel(R) Xeon(R) CPU E5-2690 v3 @ 2.60GHz x 48                        |
| 396150728 kB                                                          |
| amazone.esat.kuleuven.be                     Tue Jul 13 11:50:16 2021 |
|                                                                       |
+-----------------------------------------------------------------------+
Command-line: /esat/micas-data/software/Mentor/catapult_10.5c/pkgs/cds_ppro/rls/bin/powerpro /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_opt_v/iter_write_rtl/calypto_insert_stb_c/0/build.tcl -slec -workdir /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_opt_v/iter_write_rtl/calypto_insert_stb_c/0/build -logfile build.log -e 'set_global exit_on_error 1; set_global __exit_after_tcl_script_because 1' -license_daemon mgcld -mgls_license_file 

Auto-loading slec_utils.tcl ...
slec> eval {set_global exit_on_error 1; set_global __exit_after_tcl_script_because 1}
1

slec> # build_design script generated by PowerPro
slec> set_verification_mode -powerpro
set_global -if_unchanged ignore_intermediate_points                     1
set_global -if_unchanged map_z_as_symbolic                              1
set_global -if_unchanged replace_matching_x_with_constant               0
set_global -if_unchanged replace_constxz_with_zero                      1
set_global -if_unchanged sim_based_validation                           0
set_global -if_unchanged assume_array_indices_in_range                  1
set_global -if_unchanged enable_bdd_sweep                               0
set_global -if_unchanged ta_insert_bbox_on_clk_to_data_path             1
set_global -if_unchanged auto_remap_multiple_clock_domain_outputs       1
set_global -if_unchanged auto_black_box_unsupported_designware          1
set_global -if_unchanged bit_level_solver_only                          1
set_global -if_unchanged exit_on_error                                  1
set_global -if_unchanged stop_at_first_falsification                    0
set_global -if_unchanged flop_checking_at_reset                   relaxed
     [UI-MPTE]    Warning message 'TDB-CIWI' is now an error message.
     [UI-MPTE]    Warning message 'TDB-COWI' is now an error message.
     [UI-MPTE]    Warning message 'TDB-XPNS' is now an error message.
     [UI-MPTE]    Warning message 'TDB-IMCD' is now an error message.
     [UI-MID]     Message "TDB-CDFOO" is now disabled.
     [UI-MID]     Message "ORC-UTVC" is now disabled.
     [UI-MID]     Message "ORC-SIP" is now disabled.
     [UI-MID]     Message "ORC-DSA" is now disabled.
set_global -if_unchanged sim_disable_waveform_dumping                   1
slec> 
slec> # Global For Mixed Language Support.
slec> set_global enable_mixed_language_support 1
1

slec> 
slec> # Turning off global For SV Assertion synthesis Support.
slec> set_global _enable_sv_assertion_synthesis 0
0

slec> 
slec> # Global For SV Language Support.
slec> set_global _allow_sv_in_mixed_language 1
1

slec> 
slec> # Global For invoking new FE for slec.
slec> set_global _slec_new_fe_enable 1
1

slec> pushd [file dirname [info script]]
/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_opt_v/iter_write_rtl/calypto_insert_stb_c/0
slec> read_design -f rtl_mod_rel_verilog.f -verilog
     [UI-BDLM]    Please refer to /users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_opt_v/iter_write_rtl/calypto_insert_stb_c/0/build/build_design.log for a comprehensive list of messages and warnings issued in build_design. These may provide hints for debugging issues (if any) related to performance, potential out of bound accesses etc.

                  (Subsequent repetitions of this message will be suppressed.
                   Use 'enable_msg UI-BDLM' to show all repetitions.)

     [CPT-RDF]    Reading design files into the 'work' design library.
slec> cpt::mixed_lang_to_cpt top_5_32_1_1_O_addr_type_L1_32_1_1_I_addr_type_L1_32_1_1_W_addr_type_L1_5_288_8_8_O_addr_type_L2_312_8_8_I_addr_type_L2_1728_8_8_W_addr_type_L2_5_8640_8_8_O_addr_type_L3_8640_8_8_I_addr_type_L3_55296_8_8_W_addr_type_L3_O_partial_000000 -bb_list { } -cpt_lib work  -only_elaborate_no_cpt 1 
     [CPT-RDFD]   RTL design files dump enabled.
slec> popd
/users/students/r0678912/Downloads/zigzag/hls_impl/PE/Catapult/SIF/calypto_opt_v
slec> 

     [APP-EAT]    Automatically exiting after the Tcl script finished because 1.
